# Pandas Practice

This notebook is dedicated to practicing different tasks with pandas. The solutions are available in a solutions notebook, however, you should always try to figure them out yourself first.

It should be noted there may be more than one different way to answer a question or complete an exercise.

Exercises are based off (and directly taken from) the quick introduction to pandas notebook.

Different tasks will be detailed by comments or text.

For further reference and resources, it's advised to check out the [pandas documentation](https://pandas.pydata.org/pandas-docs/stable/).

In [1]:
# Import pandas
import pandas as pd

In [2]:
# Create a series of three different colours
colour = pd.Series(["red","blue","green"])

0      red
1     blue
2    green
dtype: object

In [3]:
# View the series of different colours
colour

0      red
1     blue
2    green
dtype: object

In [5]:
# Create a series of three different car types and view it
car_types= pd.Series(["suv","sports","electric"])

In [7]:
# Combine the Series of cars and colours into a DataFrame
car_data = pd.DataFrame({
    "colour":colour,
    "car_type":car_types
})
car_data

  colour  car_type
0    red       suv
1   blue    sports
2  green  electric

In [9]:
# Import "../data/car-sales.csv" and turn it into a DataFrame
df = pd.read_csv("../data/car-sales.csv")
df

     Make Colour  Odometer (KM)  Doors       Price
0  Toyota  White         150043      4   $4,000.00
1   Honda    Red          87899      4   $5,000.00
2  Toyota   Blue          32549      3   $7,000.00
3     BMW  Black          11179      5  $22,000.00
4  Nissan  White         213095      4   $3,500.00
5  Toyota  Green          99213      4   $4,500.00
6   Honda   Blue          45698      4   $7,500.00
7   Honda   Blue          54738      4   $7,000.00
8  Toyota  White          60000      4   $6,250.00
9  Nissan  White          31600      4   $9,700.00

**Note:** Since you've imported `../data/car-sales.csv` as a DataFrame, we'll now refer to this DataFrame as 'the car sales DataFrame'.

In [10]:
# Export the DataFrame you created to a .csv file
df.to_csv("dfExport.csv")

In [11]:
# Find the different datatypes of the car data DataFrame
df.dtypes

Make             object
Colour           object
Odometer (KM)     int64
Doors             int64
Price            object
dtype: object

In [12]:
# Describe your current car sales DataFrame using describe()
df.describe()

       Odometer (KM)      Doors
count      10.000000  10.000000
mean    78601.400000   4.000000
std     61983.471735   0.471405
min     11179.000000   3.000000
25%     35836.250000   4.000000
50%     57369.000000   4.000000
75%     96384.500000   4.000000
max    213095.000000   5.000000

In [13]:
# Get information about your DataFrame using info()
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 5 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Make           10 non-null     object
 1   Colour         10 non-null     object
 2   Odometer (KM)  10 non-null     int64
 3   Doors          10 non-null     int64
 4   Price          10 non-null     object
dtypes: int64(2), object(3)
memory usage: 532.0+ bytes

What does it show you?

In [15]:
# Create a Series of different numbers and find the mean of them
numseries = pd.Series([1,2,3,4,5,6])
mean=numseries.mean()
mean

np.float64(3.5)

In [16]:
# Create a Series of different numbers and find the sum of them
numseries = pd.Series([1,2,3,4,5,6])
sumofseries = numseries.sum()
sumofseries

np.int64(21)

In [19]:
# List out all the column names of the car sales DataFrame
df.columns

Index(['Make', 'Colour', 'Odometer (KM)', 'Doors', 'Price'], dtype='object')

In [20]:
# Find the length of the car sales DataFrame
len(df)

10

In [28]:
# Show the first 5 rows of the car sales DataFrame
df.head(n=5)
# or
df.head()

     Make Colour  Odometer (KM)  Doors       Price
0  Toyota  White         150043      4   $4,000.00
1   Honda    Red          87899      4   $5,000.00
2  Toyota   Blue          32549      3   $7,000.00
3     BMW  Black          11179      5  $22,000.00
4  Nissan  White         213095      4   $3,500.00

In [29]:
# Show the first 7 rows of the car sales DataFrame
df.head(7)

     Make Colour  Odometer (KM)  Doors       Price
0  Toyota  White         150043      4   $4,000.00
1   Honda    Red          87899      4   $5,000.00
2  Toyota   Blue          32549      3   $7,000.00
3     BMW  Black          11179      5  $22,000.00
4  Nissan  White         213095      4   $3,500.00
5  Toyota  Green          99213      4   $4,500.00
6   Honda   Blue          45698      4   $7,500.00

In [30]:
# Show the bottom 5 rows of the car sales DataFrame
df.tail()

     Make Colour  Odometer (KM)  Doors      Price
5  Toyota  Green          99213      4  $4,500.00
6   Honda   Blue          45698      4  $7,500.00
7   Honda   Blue          54738      4  $7,000.00
8  Toyota  White          60000      4  $6,250.00
9  Nissan  White          31600      4  $9,700.00

In [31]:
# Use .loc to select the row at index 3 of the car sales DataFrame
df.loc[3]

Make                    BMW
Colour                Black
Odometer (KM)         11179
Doors                     5
Price            $22,000.00
Name: 3, dtype: object

In [32]:
# Use .iloc to select the row at position 3 of the car sales DataFrame
df.iloc[3]

Make                    BMW
Colour                Black
Odometer (KM)         11179
Doors                     5
Price            $22,000.00
Name: 3, dtype: object

Notice how they're the same? Why do you think this is? 

Check the pandas documentation for [.loc](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.loc.html) and [.iloc](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.iloc.html). Think about a different situation each could be used for and try them out.

In [33]:
# Select the "Odometer (KM)" column from the car sales DataFrame
df["Odometer (KM)"]

0    150043
1     87899
2     32549
3     11179
4    213095
5     99213
6     45698
7     54738
8     60000
9     31600
Name: Odometer (KM), dtype: int64

In [34]:
# Find the mean of the "Odometer (KM)" column in the car sales DataFrame
df["Odometer (KM)"].mean()

np.float64(78601.4)

In [35]:
# Select the rows with over 100,000 kilometers on the Odometer
df[df["Odometer (KM)"]>=100000]

     Make Colour  Odometer (KM)  Doors      Price
0  Toyota  White         150043      4  $4,000.00
4  Nissan  White         213095      4  $3,500.00

In [36]:
# Create a crosstab of the Make and Doors columns
pd.crosstab(df["Make"],df["Doors"])

Doors   3  4  5
Make
BMW     0  0  1
Honda   0  3  0
Nissan  0  2  0
Toyota  1  3  0

In [41]:
# Group columns of the car sales DataFrame by the Make column and find the average
df.groupby(["Make"]).mean(numeric_only=True)

        Odometer (KM)  Doors
Make
BMW      11179.000000   5.00
Honda    62778.333333   4.00
Nissan  122347.500000   4.00
Toyota   85451.250000   3.75

In [50]:
# Import Matplotlib and create a plot of the Odometer column
# Don't forget to use %matplotlib inline
%matplotlib inline
import matplotlib.pyplot as plt
df["Odometer (KM)"].plot()

In [49]:
# Create a histogram of the Odometer column using hist()
df["Odometer (KM)"].hist()

In [51]:
# Try to plot the Price column using plot()
df["Prices"].hist()

KeyError: 'Prices'

Why didn't it work? Can you think of a solution?

You might want to search for "how to convert a pandas string column to numbers".

And if you're still stuck, check out this [Stack Overflow question and answer on turning a price column into integers](https://stackoverflow.com/questions/44469313/price-column-object-to-int-in-pandas).

See how you can provide the example code there to the problem here.

In [57]:
# Remove the punctuation from price column
df["Price"]= df["Price"].str.replace(r'[\$\,]',"",regex=True)

In [58]:
# Check the changes to the price column
df["Price"]

0     4000.00
1     5000.00
2     7000.00
3    22000.00
4     3500.00
5     4500.00
6     7500.00
7     7000.00
8     6250.00
9     9700.00
Name: Price, dtype: object

In [ ]:
# Remove the two extra zeros at the end of the price column
df["Price"].str[-2]

In [67]:
# Check the changes to the Price column
df["Price"]

0     400
1     500
2     700
3    2200
4     350
5     450
6     750
7     700
8     625
9     970
Name: Price, dtype: object

In [73]:
# Change the datatype of the Price column to integers
df["Price"]=df["Price"].astype(int)
df["Price"].dtypes

dtype('int64')

In [74]:
# Lower the strings of the Make column
df["Make"].str.lower()

0    toyota
1     honda
2    toyota
3       bmw
4    nissan
5    toyota
6     honda
7     honda
8    toyota
9    nissan
Name: Make, dtype: object

If you check the car sales DataFrame, you'll notice the Make column hasn't been lowered.

How could you make these changes permanent?

Try it out.

In [76]:
# Make lowering the case of the Make column permanent
df["Make"]=df["Make"].str.lower()

In [77]:
# Check the car sales DataFrame
df

     Make Colour  Odometer (KM)  Doors  Price
0  toyota  White         150043      4    400
1   honda    Red          87899      4    500
2  toyota   Blue          32549      3    700
3     bmw  Black          11179      5   2200
4  nissan  White         213095      4    350
5  toyota  Green          99213      4    450
6   honda   Blue          45698      4    750
7   honda   Blue          54738      4    700
8  toyota  White          60000      4    625
9  nissan  White          31600      4    970

Notice how the Make column stays lowered after reassigning.

Now let's deal with missing data.

In [78]:
# Import the car sales DataFrame with missing data ("../data/car-sales-missing-data.csv")
missing_data = pd.read_csv("../data/car-sales-missing-data.csv")

# Check out the new DataFrame
missing_data

     Make Colour  Odometer  Doors    Price
0  Toyota  White  150043.0    4.0   $4,000
1   Honda    Red   87899.0    4.0   $5,000
2  Toyota   Blue       NaN    3.0   $7,000
3     BMW  Black   11179.0    5.0  $22,000
4  Nissan  White  213095.0    4.0   $3,500
5  Toyota  Green       NaN    4.0   $4,500
6   Honda    NaN       NaN    4.0   $7,500
7   Honda   Blue       NaN    4.0      NaN
8  Toyota  White   60000.0    NaN      NaN
9     NaN  White   31600.0    4.0   $9,700

Notice the missing values are represented as `NaN` in pandas DataFrames.

Let's try fill them.

In [81]:
# Fill the Odometer column missing values with the mean of the column inplace
missing_data["Odometer"]=missing_data["Odometer"].fillna(missing_data["Odometer"].mean())

In [82]:
# View the car sales missing DataFrame and verify the changes
missing_data["Odometer"]

0    150043.000000
1     87899.000000
2     92302.666667
3     11179.000000
4    213095.000000
5     92302.666667
6     92302.666667
7     92302.666667
8     60000.000000
9     31600.000000
Name: Odometer, dtype: float64

In [83]:
# Remove the rest of the missing data inplace
missing_data.dropna(inplace=True)

In [84]:
# Verify the missing values are removed by viewing the DataFrame
missing_data

     Make Colour       Odometer  Doors    Price
0  Toyota  White  150043.000000    4.0   $4,000
1   Honda    Red   87899.000000    4.0   $5,000
2  Toyota   Blue   92302.666667    3.0   $7,000
3     BMW  Black   11179.000000    5.0  $22,000
4  Nissan  White  213095.000000    4.0   $3,500
5  Toyota  Green   92302.666667    4.0   $4,500

We'll now start to add columns to our DataFrame.

In [86]:
# Create a "Seats" column where every row has a value of 5
missing_data["Seats"]=5
missing_data

     Make Colour       Odometer  Doors    Price  Seats
0  Toyota  White  150043.000000    4.0   $4,000      5
1   Honda    Red   87899.000000    4.0   $5,000      5
2  Toyota   Blue   92302.666667    3.0   $7,000      5
3     BMW  Black   11179.000000    5.0  $22,000      5
4  Nissan  White  213095.000000    4.0   $3,500      5
5  Toyota  Green   92302.666667    4.0   $4,500      5

In [88]:
# Create a column called "Engine Size" with random values between 1.3 and 4.5
# Remember: If you're doing it from a Python list, the list has to be the same length
# as the DataFrame
missing_data["Engine Size"] = [1.3,2.3,3.3,4.3,2,2]
missing_data

     Make Colour       Odometer  Doors    Price  Seats  Engine Size
0  Toyota  White  150043.000000    4.0   $4,000      5          1.3
1   Honda    Red   87899.000000    4.0   $5,000      5          2.3
2  Toyota   Blue   92302.666667    3.0   $7,000      5          3.3
3     BMW  Black   11179.000000    5.0  $22,000      5          4.3
4  Nissan  White  213095.000000    4.0   $3,500      5          2.0
5  Toyota  Green   92302.666667    4.0   $4,500      5          2.0

In [92]:
# Create a column which represents the price of a car per kilometer
# Then view the DataFrame
df["Price per KM"] = df["Price"] / df["Odometer (KM)"]
df

     Make Colour  Odometer (KM)  Doors  Price  Price per KM
0  toyota  White         150043      4    400      0.002666
1   honda    Red          87899      4    500      0.005688
2  toyota   Blue          32549      3    700      0.021506
3     bmw  Black          11179      5   2200      0.196798
4  nissan  White         213095      4    350      0.001642
5  toyota  Green          99213      4    450      0.004536
6   honda   Blue          45698      4    750      0.016412
7   honda   Blue          54738      4    700      0.012788
8  toyota  White          60000      4    625      0.010417
9  nissan  White          31600      4    970      0.030696

In [95]:
# Remove the last column you added using .drop()
df.drop("Price per KM",axis=1,inplace=True)

In [98]:
# Shuffle the DataFrame using sample() with the frac parameter set to 1
# Save the the shuffled DataFrame to a new variable
shuffled=df.sample(frac=1)

Notice how the index numbers get moved around. The [`sample()`](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.sample.html) function is a great way to get random samples from your DataFrame. It's also another great way to shuffle the rows by setting `frac=1`.

In [105]:
# Reset the indexes of the shuffled DataFrame
shuffled.reset_index()
shuffled

     Make Colour  Odometer (KM)  Doors  Price
4  nissan  White         213095      4    350
9  nissan  White          31600      4    970
0  toyota  White         150043      4    400
7   honda   Blue          54738      4    700
6   honda   Blue          45698      4    750
8  toyota  White          60000      4    625
5  toyota  Green          99213      4    450
3     bmw  Black          11179      5   2200
1   honda    Red          87899      4    500
2  toyota   Blue          32549      3    700

Notice the index numbers have been changed to have order (start from 0).

In [106]:
# Change the Odometer values from kilometers to miles using a Lambda function
# Then view the DataFrame
df["Odometer (KM)"] = df["Odometer (KM)"].apply(lambda x: x/1.6)
df

     Make Colour  Odometer (KM)  Doors  Price
0  toyota  White      93776.875      4    400
1   honda    Red      54936.875      4    500
2  toyota   Blue      20343.125      3    700
3     bmw  Black       6986.875      5   2200
4  nissan  White     133184.375      4    350
5  toyota  Green      62008.125      4    450
6   honda   Blue      28561.250      4    750
7   honda   Blue      34211.250      4    700
8  toyota  White      37500.000      4    625
9  nissan  White      19750.000      4    970

In [107]:
# Change the title of the Odometer (KM) to represent miles instead of kilometers
df = df.rename(columns={"Odometer (KM)": "Odometer (Miles)"})
df

     Make Colour  Odometer (Miles)  Doors  Price
0  toyota  White         93776.875      4    400
1   honda    Red         54936.875      4    500
2  toyota   Blue         20343.125      3    700
3     bmw  Black          6986.875      5   2200
4  nissan  White        133184.375      4    350
5  toyota  Green         62008.125      4    450
6   honda   Blue         28561.250      4    750
7   honda   Blue         34211.250      4    700
8  toyota  White         37500.000      4    625
9  nissan  White         19750.000      4    970

## Extensions

For more exercises, check out the pandas documentation, particularly the [10-minutes to pandas section](https://pandas.pydata.org/pandas-docs/stable/user_guide/10min.html). 

One great exercise would be to retype out the entire section into a Jupyter Notebook of your own.

Get hands-on with the code and see what it does.

The next place you should check out are the [top questions and answers on Stack Overflow for pandas](https://stackoverflow.com/questions/tagged/pandas?sort=MostVotes&edited=true). Often, these contain some of the most useful and common pandas functions. Be sure to play around with the different filters!

Finally, always remember, the best way to learn something new to is try it. Make mistakes. Ask questions, get things wrong, take note of the things you do most often. And don't worry if you keep making the same mistake, pandas has many ways to do the same thing and is a big library. So it'll likely take a while before you get the hang of it.